# 2.用while语句打印三角形,输入一个三角形的宽度和高度，打印相应的三角形：
#   　　　如：　
#   　　　请输入三角形的宽度：３
#   　　１）打印如下：
#   　  *
#       **
#       ***
#       2)打印如下：
        #    *
#          **
#         ***
#        3)打印如下：
#        　***
#           **
#            *
#         4打印如下：
#         　***
#           **
#           *
n = int(input("输入三角形的宽度："))
i = 1
while i <= n:
    print(i*'*')
    i += 1
print('-----1-----')
i = 1
while i <= n:
    s = i*'*'
    fmt = '%'+str(n)+'s'
    print(fmt%s)
    i += 1
print('-----2-----')
i = 0
while i < n:
    s = (n-i)*'*'
    k = i*' '
    print(k+s)
    i += 1
print('-----3-----')
i = 0
while i < n:
    s = (n-i)*'*'
    print(s)
    i += 1
print('-----4-----')